; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)   
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)
        (increase (total-cost) (fly-cost ?location_from ?location_to))        
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l10_p10_c10_g10_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(person-at person1 loc10)
	(person-at person2 loc8)
	(person-at person3 loc5)
	(person-at person4 loc8)
	(person-at person5 loc10)
	(person-at person6 loc9)
	(person-at person7 loc2)
	(person-at person8 loc4)
	(person-at person9 loc9)
	(person-at person10 loc6)
(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 148)
	(= (fly-cost depot loc2) 27)
	(= (fly-cost depot loc3) 103)
	(= (fly-cost depot loc4) 194)
	(= (fly-cost depot loc5) 87)
	(= (fly-cost depot loc6) 213)
	(= (fly-cost depot loc7) 144)
	(= (fly-cost depot loc8) 114)
	(= (fly-cost depot loc9) 55)
	(= (fly-cost depot loc10) 128)
	(= (fly-cost loc1 depot) 148)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 125)
	(= (fly-cost loc1 loc3) 96)
	(= (fly-cost loc1 loc4) 60)
	(= (fly-cost loc1 loc5) 89)
	(= (fly-cost loc1 loc6) 83)
	(= (fly-cost loc1 loc7) 75)
	(= (fly-cost loc1 loc8) 36)
	(= (fly-cost loc1 loc9) 105)
	(= (fly-cost loc1 loc10) 80)
	(= (fly-cost loc2 depot) 27)
	(= (fly-cost loc2 loc1) 125)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 97)
	(= (fly-cost loc2 loc4) 175)
	(= (fly-cost loc2 loc5) 60)
	(= (fly-cost loc2 loc6) 195)
	(= (fly-cost loc2 loc7) 131)
	(= (fly-cost loc2 loc8) 90)
	(= (fly-cost loc2 loc9) 47)
	(= (fly-cost loc2 loc10) 118)
	(= (fly-cost loc3 depot) 103)
	(= (fly-cost loc3 loc1) 96)
	(= (fly-cost loc3 loc2) 97)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 112)
	(= (fly-cost loc3 loc5) 113)
	(= (fly-cost loc3 loc6) 126)
	(= (fly-cost loc3 loc7) 46)
	(= (fly-cost loc3 loc8) 84)
	(= (fly-cost loc3 loc9) 51)
	(= (fly-cost loc3 loc10) 30)
	(= (fly-cost loc4 depot) 194)
	(= (fly-cost loc4 loc1) 60)
	(= (fly-cost loc4 loc2) 175)
	(= (fly-cost loc4 loc3) 112)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 147)
	(= (fly-cost loc4 loc6) 24)
	(= (fly-cost loc4 loc7) 71)
	(= (fly-cost loc4 loc8) 92)
	(= (fly-cost loc4 loc9) 143)
	(= (fly-cost loc4 loc10) 85)
	(= (fly-cost loc5 depot) 87)
	(= (fly-cost loc5 loc1) 89)
	(= (fly-cost loc5 loc2) 60)
	(= (fly-cost loc5 loc3) 113)
	(= (fly-cost loc5 loc4) 147)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 170)
	(= (fly-cost loc5 loc7) 129)
	(= (fly-cost loc5 loc8) 56)
	(= (fly-cost loc5 loc9) 79)
	(= (fly-cost loc5 loc10) 121)
	(= (fly-cost loc6 depot) 213)
	(= (fly-cost loc6 loc1) 83)
	(= (fly-cost loc6 loc2) 195)
	(= (fly-cost loc6 loc3) 126)
	(= (fly-cost loc6 loc4) 24)
	(= (fly-cost loc6 loc5) 170)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 82)
	(= (fly-cost loc6 loc8) 115)
	(= (fly-cost loc6 loc9) 161)
	(= (fly-cost loc6 loc10) 97)
	(= (fly-cost loc7 depot) 144)
	(= (fly-cost loc7 loc1) 75)
	(= (fly-cost loc7 loc2) 131)
	(= (fly-cost loc7 loc3) 46)
	(= (fly-cost loc7 loc4) 71)
	(= (fly-cost loc7 loc5) 129)
	(= (fly-cost loc7 loc6) 82)
	(= (fly-cost loc7 loc7) 1)
	(= (fly-cost loc7 loc8) 82)
	(= (fly-cost loc7 loc9) 89)
	(= (fly-cost loc7 loc10) 17)
	(= (fly-cost loc8 depot) 114)
	(= (fly-cost loc8 loc1) 36)
	(= (fly-cost loc8 loc2) 90)
	(= (fly-cost loc8 loc3) 84)
	(= (fly-cost loc8 loc4) 92)
	(= (fly-cost loc8 loc5) 56)
	(= (fly-cost loc8 loc6) 115)
	(= (fly-cost loc8 loc7) 82)
	(= (fly-cost loc8 loc8) 1)
	(= (fly-cost loc8 loc9) 77)
	(= (fly-cost loc8 loc10) 79)
	(= (fly-cost loc9 depot) 55)
	(= (fly-cost loc9 loc1) 105)
	(= (fly-cost loc9 loc2) 47)
	(= (fly-cost loc9 loc3) 51)
	(= (fly-cost loc9 loc4) 143)
	(= (fly-cost loc9 loc5) 79)
	(= (fly-cost loc9 loc6) 161)
	(= (fly-cost loc9 loc7) 89)
	(= (fly-cost loc9 loc8) 77)
	(= (fly-cost loc9 loc9) 1)
	(= (fly-cost loc9 loc10) 74)
	(= (fly-cost loc10 depot) 128)
	(= (fly-cost loc10 loc1) 80)
	(= (fly-cost loc10 loc2) 118)
	(= (fly-cost loc10 loc3) 30)
	(= (fly-cost loc10 loc4) 85)
	(= (fly-cost loc10 loc5) 121)
	(= (fly-cost loc10 loc6) 97)
	(= (fly-cost loc10 loc7) 17)
	(= (fly-cost loc10 loc8) 79)
	(= (fly-cost loc10 loc9) 74)
	(= (fly-cost loc10 loc10) 1)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person5 medicine)
	(has-content-person person6 food)
	(has-content-person person8 food)
	(has-content-person person9 medicine)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate6 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space1)
   goals met: 1 of 11
2. (put-crate-in-carrier crate10 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space2)
   goals met: 1 of 11
3. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 0 of 11
4. (pick-and-drop crate10 loc5 drone1 carrier1 space2 person3 medicine)
   deleted: (crate-at-space crate10 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person3 medicine)
   goals met: 1 of 11
5. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 11
6. (put-crate-in-carrier crate9 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space2)
   goals met: 2 of 11
7. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 1 of 11
8. (pick-and-drop crate6 loc4 drone1 carrier1 space1 person8 food)
   deleted: (crate-at-space crate6 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person8 food)
   goals met: 2 of 11
9. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 11
10. (put-crate-in-carrier crate5 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space1)
   goals met: 3 of 11
11. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 2 of 11
12. (pick-and-drop crate5 loc8 drone1 carrier1 space1 person2 food)
   deleted: (crate-at-space crate5 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person2 food)
   goals met: 3 of 11
13. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 11
14. (put-crate-in-carrier crate4 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space1)
   goals met: 4 of 11
15. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 3 of 11
16. (pick-and-drop crate4 loc8 drone1 carrier1 space1 person4 food)
   deleted: (crate-at-space crate4 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person4 food)
   goals met: 4 of 11
17. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 11
18. (put-crate-in-carrier crate3 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space1)
   goals met: 5 of 11
19. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 4 of 11
20. (pick-and-drop crate9 loc8 drone1 carrier1 space2 person4 medicine)
   deleted: (crate-at-space crate9 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person4 medicine)
   goals met: 5 of 11
21. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 11
22. (put-crate-in-carrier crate8 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space2)
   goals met: 6 of 11
23. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 5 of 11
24. (pick-and-drop crate3 loc10 drone1 carrier1 space1 person1 food)
   deleted: (crate-at-space crate3 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person1 food)
   goals met: 6 of 11
25. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 11
26. (put-crate-in-carrier crate2 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space1)
   goals met: 7 of 11
27. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 6 of 11
28. (pick-and-drop crate2 loc10 drone1 carrier1 space1 person5 food)
   deleted: (crate-at-space crate2 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person5 food)
   goals met: 7 of 11
29. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 11
30. (put-crate-in-carrier crate1 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space1)
   goals met: 8 of 11
31. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 7 of 11
32. (pick-and-drop crate1 loc9 drone1 carrier1 space1 person6 food)
   deleted: (crate-at-space crate1 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person6 food)
   goals met: 8 of 11
33. (pick-and-drop crate8 loc9 drone1 carrier1 space2 person9 medicine)
   deleted: (crate-at-space crate8 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person9 medicine)
   goals met: 9 of 11
34. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 11
35. (put-crate-in-carrier crate7 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space1)
   goals met: 10 of 11
36. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 9 of 11
37. (pick-and-drop crate7 loc10 drone1 carrier1 space1 person5 medicine)
   deleted: (crate-at-space crate7 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person5 medicine)
   goals met: 10 of 11
38. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 11
